Revit 2024 API
ParameterTypeId.StairsRailingShape Property
 "Rail Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRailingShape { get; }
Visual Basic
Public Shared ReadOnly Property StairsRailingShape As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRailingShape {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace